data = { 
    "公司登記表",
    "公司章程",
    "申請書",
    "委託書",
    "股東身分證",
    "房屋稅單",#客戶提供 給事務所
    "房屋使用同意書",#給客戶蓋章文件
    "資本簽證報告",
    "預查表",
    "公司送件委託書",
    "登記印鑑章"
}#公司設立時需要的共同 基本文件
data2 = { 
    "發起人會議事錄",
    "發起人名冊",
    "董事會議事錄",
    "願任董監事同意書", #給客戶簽名文件
} #設立時股份有限公司

data3 = { 
    "股東同意書",#給客戶簽名文件
} #設立時股份有限公司

data4 = { 
    "發起人會議事錄",
    "發起人名冊",
    "願任董監事同意書",#給客戶簽名文件
} #設立時股份有限公司 一董一監



result_1 = data | data2 #股份有限公司設立三董一監案 result_1 
result_2 = data | data3 #有限公司設立案 result_2
result_3 = data | data4 #股份有限公司設立一董一監案 result_3

print("股份三董一監設立需要文件:",result_1)
print("有限設立需要文件:",result_2)
print("股份一董一監設立需要文件:",result_3)